'use client';

import React from 'react'
import 'leaflet/dist/leaflet.css';
import MarkerClusterGroup from "react-leaflet-cluster";

import { MapContainer, TileLayer, Marker, Popup } from 'react-leaflet'
import { Icon, divIcon, point } from "leaflet";

export default function Map(){

    const customIcon = new Icon({
        iconUrl: 'https://cdn-icons-png.flaticon.com/128/8637/8637632.png',
        iconSize: [38, 38]
    })

    const createClusterCustomIcon = function (cluster) {
        return new divIcon({
            html:`<div class="flex items-center justify-center bg-[#78F392] text-white font-bold rounded-full w-[40px] h-[40px] shadow-md hover:scale-110 transition-transform">
            ${cluster.getChildCount()}`,
            className: "custom-marker-cluster",
            iconSize: point(33, 33, true)
        }
            
        )
};

    const markers = [
    {
        geocode: [36.752241571129616, 3.0648099841162084],
        popUp: "جمعية القلوب الرحيمة الخيرية"
    },
    {
        geocode: [36.754386480165735, 3.057612932016987],
        popUp: "مؤسسة التوفيق الخيرية"
    },
    {
        geocode: [36.73031488421817, 3.0465288141824445],
        popUp: "Association elbarakah"
    },
    {
        geocode: [36.773243417044384, 3.0167898525661405],
        popUp: "جمعية سواعد الخير الأبيار"
    },
    {
        geocode: [36.7609170352901, 3.000823258552652],
        popUp: "جمعية الشهاب الثقافية و العلمية و الخيرية لبلدية بن عكنون"
    },
    {
        geocode: [36.726399152922305, 3.013011214128746],
        popUp: "جمعية قوافل الخير لرعاية الأرملة واليتيم فرع السبالة"
    },
    {
        geocode: [36.72172106519775, 3.0104362948946943],
        popUp: "جمعية البركة للعمل الخيري و الانساني_مكتب درارية_"
    },
    {
        geocode: [36.725573628868105, 3.05867314174448],
        popUp: "Winnelka Bureau d'Alger"
    },
    {
        geocode: [36.73286545216809, 3.097811934962841],
        popUp: "جمعية ايادي العطاء الخيرية"
    },
    {
        geocode: [36.721858660166895, 3.090602157413513],
        popUp: "جمعية الغيث الخيرية - فرع القبة"
    },
    {
        geocode: [36.717317898871705, 3.092147109745512],
        popUp: "جمعية الغيث الخيرية فرع الطرق الأربعة باش جراح"
    },
    {
        geocode: [36.72155372352277, 3.1133264458518854],
        popUp: "جمعية البركة للعمل الخيري والإنساني"
    },
    {
        geocode: [36.709326956044066, 3.0002554903167384],
        popUp: "جمعية الأمل و الإحسان"
    },
    {
        geocode: [36.764294912954675, 2.9275735484693306],
        popUp: "الموسسة الخيرية أضواء البيان لتوعية والتكافل"
    },
    {
        geocode: [36.78959417904408, 2.9045709248595686],
        popUp: "جمعية البركة الخيرية مكتب عين بنيان"
    },
    {
        geocode: [36.71134883846805, 3.164539552575697],
        popUp: "جمعية الانصاف الخيرية"
    },
    {
        geocode: [36.73608735274588, 3.1792910694287535],
        popUp: "Zed fondation"
    },
    {
        geocode: [36.74310306469669, 3.1708796622878745],
        popUp: "Fondation de l’Algérie unis"
    },
    {
        geocode: [36.747472811984956, 3.215990065882121],
        popUp: "جمعية الفرقان للتكافل الإجتماعي برج الكيفان"
    },
    {
        geocode: [36.7598426156208, 3.2355272759225655],
        popUp: "جمعية كافل اليتيم - برج الكيفان"
    },
    {
        geocode: [36.76108034579044, 3.230892418186159],
        popUp: "Fondation de l’Algérie unis"
    },
    {
        geocode: [36.74310306469669, 3.1708796622878745],
        popUp: "جمعية كافل اليتيم برج الكيفان بن مراد"
    },
    {
        geocode: [36.72099755865861, 3.1178041094587394],
        popUp: "جمعية الخير في قلوبنا"
    },
    {
        geocode: [36.726536739353165, 3.1066149462521744],
        popUp: "جمعية إسعى للخير الوطنية مكتب باش جراح"
    },
    {
        geocode: [36.73231514985616, 3.1089323747501725],
        popUp: "الجمعية التطوعية للعمل الخيري"
    },
    {
        geocode: [27.901586081279664, -0.279523838536252],
        popUp: "جمعية تسنيم الخيرية للشلل الحركي الدماغي"
    },
    {
        geocode: [27.875345380168483, -0.2848749582441731],
        popUp: "Orphans Association Adrar"
    },
    {
        geocode: [27.87429267394027, -0.28631845275650947],
        popUp: "جمعية همزة وصل للاعمال الخيرية ادرار"
    },
    {
        geocode: [27.87729126449304, -0.29046849903091465],
        popUp: "جمعيه البركة للعمل الخيري و الإنساني المكتب الولائي أدراى"
    },
    {
        geocode: [36.167583586971645, 1.3334921507270112],
        popUp: "مكتب جمعية البركة شلف"
    },
    {
        geocode: [36.15871900141312, 1.3370206469752637],
        popUp: "مقر الجمعية الخيرية - شباب الخير لولاية الشلف"
    },
    {
        geocode: [36.15788949201526, 1.3180865477271742],
        popUp: "جمعية سلطانة للاعمال الخيرية بالشلف"
    },
    {
        geocode: [36.14629900984874, 1.3047835823323157],
        popUp: "جمعية بدر الخيرية لإدماج و حماية الشباب لولاية الشلف"
    },
    {
        geocode: [33.78151895260847, 2.8438305505764294],
        popUp: "جمعية البركة للعمل الخيري والانساني الاغواط"
    },
    {
        geocode: [33.794830145084845, 2.8559354662835297],
        popUp: "الجمعية الخيرية كافل اليتيم الوطنية المكتب الولائي بالأغواط"
    },
    {
        geocode: [33.8121497169855, 2.8567656392920022],
        popUp: "مقر جمعية الرحمة الخيرية الأغواط"
    },
    {
        geocode: [33.81172183286826, 2.8464659566377937],
        popUp: "جمعية البركة للعمل الخيري والإنساني المكتب البلدي بالأغواط"
    },
    {
        geocode: [35.87222491446578, 7.118142500805557],
        popUp: "Association Forsan Lkhir"
    },
    {
        geocode: [35.88057057325684, 7.110417739145562],
        popUp: "الهلال الاحمر الجزائري ام البواقي"
    },
    {
        geocode: [35.87277697219136, 7.097849248328656],
        popUp: "جمعية البركة للعمل الخيري والإنساني -أم البواقي-"
    },
    {
        geocode: [35.52368834042806, 6.213203541944851],
        popUp: "مؤسسة مصابيح الدجى الخيرية"
    },
    {
        geocode: [35.53118723120245, 6.184755562245034],
        popUp: "جمعية الرحمة"
    },
    {
        geocode: [35.53188571769868, 6.16887688549949],
        popUp: "الجمعية الخيرية كافل اليتيم الولائية باتنة"
    },
    {
        geocode: [35.540108149731196, 6.195546572505545],
        popUp: "Dar Almaridh"
    },
    {
        geocode: [35.54292710195334, 6.199877055431264],
        popUp: "(ماء حلو )صدقة جارية"
    },
    {
        geocode: [35.56165887149826, 6.194391777689788],
        popUp: "جمعية ايثار الخيرية لولاية باتنة"
    },
    {
        geocode: [35.56424222031054, 6.188978674032637],
        popUp: "جمعية الدنيا بخير الفرع الثقافي منة الله"
    },
    {
        geocode: [35.55420192030688, 6.177069845514292],
        popUp: "الهلال الأحمر الجزائري - باتنة"
    },
    {
        geocode: [35.55244033449739, 6.175265477628576],
        popUp: "جمعية البركة باتنة"
    },
    {
        geocode: [35.55311680505992, 6.160080697939965],
        popUp: "نادي إبتسامة للنشاطات الخيرية و الثقافية"
    },
    {
        geocode: [35.539917875530705, 6.160853174617525],
        popUp: "جمعية باب الخير - باتنة"
    },
    {
        geocode: [36.731136410705936, 5.041584607574328],
        popUp: "Association Ahl EL Khir Ihaddaden Oufella Bejaia"
    },
    {
        geocode: [36.741866755524256, 5.064587231184089],
        popUp: "Association d'aide aux enfants autistes de la wilaya de Béjaia"
    },
    {
        geocode: [36.711426548671916, 4.975433346580424],
        popUp: "Headquarters of the Society sponsors an orphan municipality Wade branch non-Bejaia"
    },
    {
        geocode: [36.74566937501193, 5.051587287581381],
        popUp: "الجمعية الخيرية انشراح"
    },
    {
        geocode: [36.74751303582922, 5.041361209675457],
        popUp: "مقر جمعية البركة مكتب بجاية"
    },
    {
        geocode: [36.753965499859696, 5.0559333706914],
        popUp: "Association Kafil El Yatim Bejaia"
    },
    {
        geocode: [36.75314616942612, 5.059256846010826],
        popUp: "Association Errahma d'aide aux personnes âgées en difficulté de la wilaya de Béjaia"
    },
    {
        geocode: [36.757242734090816, 5.0579785862725855],
        popUp: "Association la Voix de l'Enfant de la wilaya de Bejaia"
    },
    {
        geocode: [34.853294794498765, 5.7288012977445195],
        popUp: "Elbarakah biskra"
    },
    {
        geocode: [34.84244721179637, 5.7300029273360735],
        popUp: "الجمعية الخيرية كافل اليتيم مكتب الولائي بسكرة"
    },
    {
        geocode: [34.84660327284286, 5.725024747599633],
        popUp: "جمعية طيبة الخيرية"
    },
    {
        geocode: [34.854703466558945, 5.725282239654967],
        popUp: "جمعية تكافل للعمل الخيري والٳنساني بسكرة وسط"
    },
    {
        geocode: [31.619117965804197, -2.220172374868962],
        popUp: "Bureau Djazair el Kheir Béchar"
    },
    {
        geocode: [31.60625209971299, -2.230450977955987],
        popUp: "جمعية البركة للعمل الخيري و الإنساني _مكتب الولائي بشار _"
    },
    {
        geocode: [36.54645067629872, 3.0798377799625056],
        popUp: "جمعية سواعد الإحسان بوقرة البليدة"
    },
    {
        geocode: [36.566080130604526, 3.1512479878729414],
        popUp: "الجمعية الخيرية كافل اليتيم لولاية البليدة فرع الأربعاء"
    },
    {
        geocode: [36.5209319541368, 2.8430830113472756],
        popUp: "جمعية سواعد الاحسان المكتب الولائي ولاية البليدة"
    },
    {
        geocode: [36.53173547892564, 2.8622471806599346],
        popUp: "Association kafil el yatim blida"
    },
    {
        geocode: [36.52727757146956, 2.8149305466308507],
        popUp: "جمعية أم اليتيم البليدة"
    },
    {
        geocode: [36.489301149303664, 2.8378310035222434],
        popUp: "جمعية قوافل الخير لرعاية الأرملة واليتيم فرع البليدة"
    },
    {
        geocode: [36.476770495183075, 2.8311637321807255],
        popUp: "جمعية البركة الخيرية - فرع البليدة"
    },
    {
        geocode: [36.48090092155398, 2.809680479372074],
        popUp: "جمعية رفيق المسلم الخيرية لرعاية اليتيم البليدة"
    },
    {
        geocode: [36.48024642997904, 2.807083072594344],
        popUp: "جمعية الرجاء الخيرية لمساعدة مرضى السرطان"
    },
    {
        geocode: [36.47921122530439, 2.806096019715566],
        popUp: "جمعية سواعد الإحسان - فرع بلدية البليدة"
    },
    {
        geocode: [36.17612901610246, 3.694767057631135],
        popUp: "جمعية البركة للعمل الخيري والإنساني"
    },
    {
        geocode: [36.38031095579305, 3.9007779065985626],
        popUp: "جمعية كافل اليتيم - البويرة"
    },
    {
        geocode: [36.37565069019092, 3.8856888080281053],
        popUp: "جمعية نور الأمل لمرضى السرطان"
    },
    {
        geocode: [36.37565069019092, 3.8856888080281053],
        popUp: "Association Manabie El-Kheir"
    },
    {
        geocode: [36.389128914523624, 3.874690708256217],
        popUp: "Association Winnelka de Bouira"
    },
    {
        geocode: [22.788369816498687, 5.528111180023986],
        popUp: "جمعية كافل اليتيم تمنراست"
    },
    {
        geocode: [22.806417679998912, 5.51618929151333],
        popUp: "زاوية عبد الرحمن الابودي"
    },
    {
        geocode: [35.415333468890175, 8.101015778738592],
        popUp: "المنظمة الجزائرية للعمل الخيري والانساني"
    },
    {
        geocode: [35.40630945601716, 8.11294624471955],
        popUp: "جمعية نجدة الانسانية (المقر الجديد)"
    },
    {
        geocode: [35.40696936537262, 8.113646814074961],
        popUp: "جمعية جسر الأمل لمرضى التوحد تبسة"
    },
    {
        geocode: [34.91468686272761, -1.3486576109871147],
        popUp: "الفضاء الإعلامي و التكويني لجمعية مساعدة المرضى و المحتاجين"
    },
    {
        geocode: [34.885262078757265, -1.3357830063021159],
        popUp: "Kafil el yatim tlemcen كافل اليتيم مكتب تلمسان"
    },
    {
        geocode: [34.880781293496554, -1.3227132099680419],
        popUp: "ASSOCIATION ELBARAKAH TLEMCEN"
    },
    {
        geocode: [34.88705432445632, -1.3131239593708477],
        popUp: "جمعية البركة تلمسان ELBARAKAH TLEMCEN"
    },
    {
        geocode: [34.88665605101244, -1.3117887472623777],
        popUp: "Croissant rouge algérien"
    },
    {
        geocode: [35.380687254214436, 1.3310904439313074],
        popUp: "جمعية كافل اليتيم الولائية تيارت المكتب الولائي"
    },
    {
        geocode: [35.38039035480238, 1.325870978416379],
        popUp: "جمعية المسعفين المتطوعين تيارت"
    },
    {
        geocode: [35.36970124835183, 1.3270848076058974],
        popUp: "جمعية الطيبين الخيرية"
    },
    {
        geocode: [35.35961875146803, 1.3297714385742188],
        popUp: "جمعية الإخلاص والأصالة"
    },
    {
        geocode: [35.35215291522565, 1.308268903205158],
        popUp: "Orphans Association state office Tiaret state levels"
    },
    {
        geocode: [35.35250293694916, 1.3388246284778218],
        popUp: "جمعية كافل اليتيم الولائية المكتب البلدي تيارت"
    },
    {
        geocode: [35.34858260820605, 1.3353914010733796],
        popUp: "(مدرسة النبي اليتيم  (جمعية كافل اليتيم الولائية تيارت"
    },
    {
        geocode: [35.345486901459246, 1.328232585635004],
        popUp: "جمعية سواعد الاحسان تيارت"
    },
    {
        geocode: [36.700407642290415, 4.060947651857733],
        popUp: "Association Thafounasth Igoujilene"
    },
    {
        geocode: [36.70278088380241, 4.058191749399403],
        popUp: "Bureau association kafil el yatim"
    },
    {
        geocode: [36.703251014861316, 4.043805256761649],
        popUp: "Bureau El Baraka Tizi-ouzou"
    },
    {
        geocode: [36.70765498747024, 4.039427891820986],
        popUp: "Association nationale des commerçants et artisans Tizi Ouzou"
    },
    {
        geocode: [36.712609154992926, 4.051272526366311],
        popUp: "Association Assirem de Tizi ouzou"
    },
    {
        geocode: [36.71426047318507, 4.047667637591647],
        popUp: "Thafat Évènements"
    },
    {
        geocode: [36.71673738392552, 4.05522073788142],
        popUp: "Association (El Fedjr) d'aide aux personnes atteintes de cancer"
    },
    {
        geocode: [34.69428487527585, 3.269410972524661],
        popUp: "جمعية الإحياء التضامنية الخيرية"
    },
    {
        geocode: [34.67780701176577, 3.2517170891258576],
        popUp: "جمعية البركة للعمل الخيري والإنساني"
    },
    {
        geocode: [34.674802721085165, 3.2419913992042204],
        popUp: "الجمعية الخيرية كافل اليتيم بالجلفة"
    },
    {
        geocode: [34.67370862046888, 3.237217067167786],
        popUp: "الجمعية الخيرية الولائية للعلامة سيدي محمد بن المشري"
    },
    {
        geocode: [34.67194881491892, 3.2499237132435748],
        popUp: "جمعية تراحم الخيرية الحزائرية"
    },
    {
        geocode: [34.66970267714795, 3.2477649716429147],
        popUp: "جمعية الفجر لمساعدة مرضى السرطان"
    },
    {
        geocode: [34.666419440916194, 3.2517699985419664],
        popUp: "جمعية جزائر الخير الجلفة"
    },
    {
        geocode: [36.81876318823402, 5.768024490135091],
        popUp: "الجمعية الولائية الخيرية نور الناس"
    },
    {
        geocode: [36.81299129007597, 5.767209098626536],
        popUp: "جمعية البركة للعمل الخيري و الإنساني مكتب جيجل"
    },
    {
        geocode: [36.81336922524827, 5.772831008566936],
        popUp: "Kafil El Yatim Jijel"
    },
    {
        geocode: [36.80635652658584, 5.761666900629126],
        popUp: "جمعية الإرشاد والإصلاح"
    },
    {
        geocode: [36.80873709561762, 5.759031897496229],
        popUp: "Association Al Rissala"
    },
    {
        geocode: [36.80547285062124, 5.756929045711009],
        popUp: "جمعية بصمة خير جيجل"
    },
    {
        geocode: [36.15122094526114, 5.447062218447455],
        popUp: "جمعية سواعد الخير سطيف"
    },
    {
        geocode: [36.18970661274889, 5.400039222650665],
        popUp: "ness el khir setif"
    },
    {
        geocode: [36.191992524488455, 5.397464302097332],
        popUp: "جمعية بشرى ام الايتام لمرضى السرطان سطيف"
    },
    {
        geocode: [36.19379349886219, 5.393773582637557],
        popUp: "جمعية البركة سطيف"
    },
    {
        geocode: [36.19649488272165, 5.402528312862168],
        popUp: "جمعية الوئام الخيرية"
    },
    {
        geocode: [36.194555437054404, 5.414287116722382],
        popUp: "جمعية كافل اليتيم سطيف"
    },
    {
        geocode: [36.197395323394645, 5.426475074725001],
        popUp: "جمعية الإرشاد والإصلاح، بلدية سطيف"
    },
    {
        geocode: [36.2017588503076, 5.443126227636545],
        popUp: "جمعية مهي للاعمال الخيرية"
    },
    {
        geocode: [36.20418292684443, 5.414372948033471],
        popUp: "مقر جمعية شبابنا سطيف"
    },
    {
        geocode: [36.203698117545315, 5.412313011590804],
        popUp: "جمعية الأيادي الآمنة الخيرية لولاية سطيف"
    },
    {
        geocode: [36.203005527623375, 5.411197212684361],
        popUp: "جمعية غيث للعمل الخيري والإنساني"
    },
    {
        geocode: [36.71673738392552, 4.05522073788142],
        popUp: "Association (El Fedjr) d'aide aux personnes atteintes de cancer"
    },
];

    return (
        <div className="w-full h-[500px] rounded-2xl overflow-hidden shadow-lg border border-gray-300">
            <MapContainer center={[36.743002, 3.084316]} zoom={11} className="w-full h-full">
        {/*<TileLayer
            attribution='&copy; <a href="https://www.openstreetmap.org/copyright">OpenStreetMap</a> contributors'
            url='https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png'

        />*/}

        <TileLayer
        attribution='AlidadeSatellite'
        url='https://tiles.stadiamaps.com/tiles/alidade_satellite/{z}/{x}/{y}{r}.jpg'
    />
        <MarkerClusterGroup
        chunkedLoading
        iconCreateFunction={createClusterCustomIcon}>

        {markers.map((marker, index) => (
            <Marker key={index} position={marker.geocode} icon={customIcon}>
                <Popup>{marker.popUp}</Popup>
            </Marker>
        ))}
        </MarkerClusterGroup>
        </MapContainer>
        </div>
)
}
