'use client';

import React from 'react'
import 'leaflet/dist/leaflet.css';
import MarkerClusterGroup from "react-leaflet-cluster";

import { MapContainer, TileLayer, Marker, Popup } from 'react-leaflet'
import { Icon, divIcon, point } from "leaflet";

export default function Map(){

    const customIcon = new Icon({
        iconUrl: 'https://cdn-icons-png.flaticon.com/128/8637/8637632.png',
        iconSize: [38, 38]
    })

    const createClusterCustomIcon = function (cluster) {
        return new divIcon({
            html:`<div class="flex items-center justify-center bg-[#78F392] text-white font-bold rounded-full w-[40px] h-[40px] shadow-md hover:scale-110 transition-transform">
            ${cluster.getChildCount()}`,
            className: "custom-marker-cluster",
            iconSize: point(33, 33, true)
        }
            
        )
};

    const markers = [
    {
        geocode: [36.752241571129616, 3.0648099841162084],
        popUp: "جمعية القلوب الرحيمة الخيرية"
    },
    {
        geocode: [36.754386480165735, 3.057612932016987],
        popUp: "مؤسسة التوفيق الخيرية"
    },
    {
        geocode: [36.73031488421817, 3.0465288141824445],
        popUp: "Association elbarakah"
    },
    {
        geocode: [36.773243417044384, 3.0167898525661405],
        popUp: "جمعية سواعد الخير الأبيار"
    },
    {
        geocode: [36.7609170352901, 3.000823258552652],
        popUp: "جمعية الشهاب الثقافية و العلمية و الخيرية لبلدية بن عكنون"
    },
    {
        geocode: [36.726399152922305, 3.013011214128746],
        popUp: "جمعية قوافل الخير لرعاية الأرملة واليتيم فرع السبالة"
    },
    {
        geocode: [36.72172106519775, 3.0104362948946943],
        popUp: "جمعية البركة للعمل الخيري و الانساني_مكتب درارية_"
    },
    {
        geocode: [36.725573628868105, 3.05867314174448],
        popUp: "Winnelka Bureau d'Alger"
    },
    {
        geocode: [36.73286545216809, 3.097811934962841],
        popUp: "جمعية ايادي العطاء الخيرية"
    },
    {
        geocode: [36.721858660166895, 3.090602157413513],
        popUp: "جمعية الغيث الخيرية - فرع القبة"
    },
    {
        geocode: [36.717317898871705, 3.092147109745512],
        popUp: "جمعية الغيث الخيرية فرع الطرق الأربعة باش جراح"
    },
    {
        geocode: [36.72155372352277, 3.1133264458518854],
        popUp: "جمعية البركة للعمل الخيري والإنساني"
    },
    {
        geocode: [36.709326956044066, 3.0002554903167384],
        popUp: "جمعية الأمل و الإحسان"
    },
    {
        geocode: [36.764294912954675, 2.9275735484693306],
        popUp: "الموسسة الخيرية أضواء البيان لتوعية والتكافل"
    },
    {
        geocode: [36.78959417904408, 2.9045709248595686],
        popUp: "جمعية البركة الخيرية مكتب عين بنيان"
    },
    {
        geocode: [36.71134883846805, 3.164539552575697],
        popUp: "جمعية الانصاف الخيرية"
    },
    {
        geocode: [36.73608735274588, 3.1792910694287535],
        popUp: "Zed fondation"
    },
    {
        geocode: [36.74310306469669, 3.1708796622878745],
        popUp: "Fondation de l’Algérie unis"
    },
    {
        geocode: [36.747472811984956, 3.215990065882121],
        popUp: "جمعية الفرقان للتكافل الإجتماعي برج الكيفان"
    },
    {
        geocode: [36.7598426156208, 3.2355272759225655],
        popUp: "جمعية كافل اليتيم - برج الكيفان"
    },
    {
        geocode: [36.76108034579044, 3.230892418186159],
        popUp: "Fondation de l’Algérie unis"
    },
    {
        geocode: [36.74310306469669, 3.1708796622878745],
        popUp: "جمعية كافل اليتيم برج الكيفان بن مراد"
    },
    {
        geocode: [36.72099755865861, 3.1178041094587394],
        popUp: "جمعية الخير في قلوبنا"
    },
    {
        geocode: [36.726536739353165, 3.1066149462521744],
        popUp: "جمعية إسعى للخير الوطنية مكتب باش جراح"
    },
    {
        geocode: [36.73231514985616, 3.1089323747501725],
        popUp: "الجمعية التطوعية للعمل الخيري"
    },
    {
        geocode: [27.901586081279664, -0.279523838536252],
        popUp: "جمعية تسنيم الخيرية للشلل الحركي الدماغي"
    },
    {
        geocode: [27.875345380168483, -0.2848749582441731],
        popUp: "Orphans Association Adrar"
    },
    {
        geocode: [27.87429267394027, -0.28631845275650947],
        popUp: "جمعية همزة وصل للاعمال الخيرية ادرار"
    },
    {
        geocode: [27.87729126449304, -0.29046849903091465],
        popUp: "جمعيه البركة للعمل الخيري و الإنساني المكتب الولائي أدرار"
    },
    {
        geocode: [36.167583586971645, 1.3334921507270112],
        popUp: "مكتب جمعية البركة شلف"
    },
    {
        geocode: [36.15871900141312, 1.3370206469752637],
        popUp: "مقر الجمعية الخيرية - شباب الخير لولاية الشلف"
    },
    {
        geocode: [36.15788949201526, 1.3180865477271742],
        popUp: "جمعية سلطانة للاعمال الخيرية بالشلف"
    },
    {
        geocode: [36.14629900984874, 1.3047835823323157],
        popUp: "جمعية بدر الخيرية لإدماج و حماية الشباب لولاية الشلف"
    },
    {
        geocode: [33.78151895260847, 2.8438305505764294],
        popUp: "جمعية البركة للعمل الخيري والانساني الاغواط"
    },
    {
        geocode: [33.794830145084845, 2.8559354662835297],
        popUp: "الجمعية الخيرية كافل اليتيم الوطنية المكتب الولائي بالأغواط"
    },
    {
        geocode: [33.8121497169855, 2.8567656392920022],
        popUp: "مقر جمعية الرحمة الخيرية الأغواط"
    },
    {
        geocode: [33.81172183286826, 2.8464659566377937],
        popUp: "جمعية البركة للعمل الخيري والإنساني المكتب البلدي بالأغواط"
    },
    {
        geocode: [35.87222491446578, 7.118142500805557],
        popUp: "Association Forsan Lkhir"
    },
    {
        geocode: [35.88057057325684, 7.110417739145562],
        popUp: "الهلال الاحمر الجزائري ام البواقي"
    },
    {
        geocode: [35.87277697219136, 7.097849248328656],
        popUp: "جمعية البركة للعمل الخيري والإنساني -أم البواقي-"
    },
    {
        geocode: [35.52368834042806, 6.213203541944851],
        popUp: "مؤسسة مصابيح الدجى الخيرية"
    },
    {
        geocode: [35.53118723120245, 6.184755562245034],
        popUp: "جمعية الرحمة"
    },
    {
        geocode: [35.53188571769868, 6.16887688549949],
        popUp: "الجمعية الخيرية كافل اليتيم الولائية باتنة"
    },
    {
        geocode: [35.540108149731196, 6.195546572505545],
        popUp: "Dar Almaridh"
    },
    {
        geocode: [35.54292710195334, 6.199877055431264],
        popUp: "(ماء حلو )صدقة جارية"
    },
    {
        geocode: [35.56165887149826, 6.194391777689788],
        popUp: "جمعية ايثار الخيرية لولاية باتنة"
    },
    {
        geocode: [35.56424222031054, 6.188978674032637],
        popUp: "جمعية الدنيا بخير الفرع الثقافي منة الله"
    },
    {
        geocode: [35.55420192030688, 6.177069845514292],
        popUp: "الهلال الأحمر الجزائري - باتنة"
    },
    {
        geocode: [35.55244033449739, 6.175265477628576],
        popUp: "جمعية البركة باتنة"
    },
    {
        geocode: [35.55311680505992, 6.160080697939965],
        popUp: "نادي إبتسامة للنشاطات الخيرية و الثقافية"
    },
    {
        geocode: [35.539917875530705, 6.160853174617525],
        popUp: "جمعية باب الخير - باتنة"
    },
    {
        geocode: [36.731136410705936, 5.041584607574328],
        popUp: "Association Ahl EL Khir Ihaddaden Oufella Bejaia"
    },
    {
        geocode: [36.741866755524256, 5.064587231184089],
        popUp: "Association d'aide aux enfants autistes de la wilaya de Béjaia"
    },
    {
        geocode: [36.711426548671916, 4.975433346580424],
        popUp: "Headquarters of the Society sponsors an orphan municipality Wade branch non-Bejaia"
    },
    {
        geocode: [36.74566937501193, 5.051587287581381],
        popUp: "الجمعية الخيرية انشراح"
    },
    {
        geocode: [36.74751303582922, 5.041361209675457],
        popUp: "مقر جمعية البركة مكتب بجاية"
    },
    {
        geocode: [36.753965499859696, 5.0559333706914],
        popUp: "Association Kafil El Yatim Bejaia"
    },
    {
        geocode: [36.75314616942612, 5.059256846010826],
        popUp: "Association Errahma d'aide aux personnes âgées en difficulté de la wilaya de Béjaia"
    },
    {
        geocode: [36.757242734090816, 5.0579785862725855],
        popUp: "Association la Voix de l'Enfant de la wilaya de Bejaia"
    },
    {
        geocode: [34.853294794498765, 5.7288012977445195],
        popUp: "Elbarakah biskra"
    },
    {
        geocode: [34.84244721179637, 5.7300029273360735],
        popUp: "الجمعية الخيرية كافل اليتيم مكتب الولائي بسكرة"
    },
    {
        geocode: [34.84660327284286, 5.725024747599633],
        popUp: "جمعية طيبة الخيرية"
    },
    {
        geocode: [34.854703466558945, 5.725282239654967],
        popUp: "جمعية تكافل للعمل الخيري والٳنساني بسكرة وسط"
    },
    {
        geocode: [31.619117965804197, -2.220172374868962],
        popUp: "Bureau Djazair el Kheir Béchar"
    },
    {
        geocode: [31.60625209971299, -2.230450977955987],
        popUp: "جمعية البركة للعمل الخيري و الإنساني _مكتب الولائي بشار _"
    },
    {
        geocode: [36.54645067629872, 3.0798377799625056],
        popUp: "جمعية سواعد الإحسان بوقرة البليدة"
    },
    {
        geocode: [36.566080130604526, 3.1512479878729414],
        popUp: "الجمعية الخيرية كافل اليتيم لولاية البليدة فرع الأربعاء"
    },
    {
        geocode: [36.5209319541368, 2.8430830113472756],
        popUp: "جمعية سواعد الاحسان المكتب الولائي ولاية البليدة"
    },
    {
        geocode: [36.53173547892564, 2.8622471806599346],
        popUp: "Association kafil el yatim blida"
    },
    {
        geocode: [36.52727757146956, 2.8149305466308507],
        popUp: "جمعية أم اليتيم البليدة"
    },
    {
        geocode: [36.489301149303664, 2.8378310035222434],
        popUp: "جمعية قوافل الخير لرعاية الأرملة واليتيم فرع البليدة"
    },
    {
        geocode: [36.476770495183075, 2.8311637321807255],
        popUp: "جمعية البركة الخيرية - فرع البليدة"
    },
    {
        geocode: [36.48090092155398, 2.809680479372074],
        popUp: "جمعية رفيق المسلم الخيرية لرعاية اليتيم البليدة"
    },
    {
        geocode: [36.48024642997904, 2.807083072594344],
        popUp: "جمعية الرجاء الخيرية لمساعدة مرضى السرطان"
    },
    {
        geocode: [36.47921122530439, 2.806096019715566],
        popUp: "جمعية سواعد الإحسان - فرع بلدية البليدة"
    },
    {
        geocode: [36.17612901610246, 3.694767057631135],
        popUp: "جمعية البركة للعمل الخيري والإنساني"
    },
    {
        geocode: [36.38031095579305, 3.9007779065985626],
        popUp: "جمعية كافل اليتيم - البويرة"
    },
    {
        geocode: [36.37565069019092, 3.8856888080281053],
        popUp: "جمعية نور الأمل لمرضى السرطان"
    },
    {
        geocode: [36.37565069019092, 3.8856888080281053],
        popUp: "Association Manabie El-Kheir"
    },
    {
        geocode: [36.389128914523624, 3.874690708256217],
        popUp: "Association Winnelka de Bouira"
    },
    {
        geocode: [22.788369816498687, 5.528111180023986],
        popUp: "جمعية كافل اليتيم تمنراست"
    },
    {
        geocode: [22.806417679998912, 5.51618929151333],
        popUp: "زاوية عبد الرحمن الابودي"
    },
    {
        geocode: [35.415333468890175, 8.101015778738592],
        popUp: "المنظمة الجزائرية للعمل الخيري والانساني"
    },
    {
        geocode: [35.40630945601716, 8.11294624471955],
        popUp: "جمعية نجدة الانسانية (المقر الجديد)"
    },
    {
        geocode: [35.40696936537262, 8.113646814074961],
        popUp: "جمعية جسر الأمل لمرضى التوحد تبسة"
    },
    {
        geocode: [34.91468686272761, -1.3486576109871147],
        popUp: "الفضاء الإعلامي و التكويني لجمعية مساعدة المرضى و المحتاجين"
    },
    {
        geocode: [34.885262078757265, -1.3357830063021159],
        popUp: "Kafil el yatim tlemcen كافل اليتيم مكتب تلمسان"
    },
    {
        geocode: [34.880781293496554, -1.3227132099680419],
        popUp: "ASSOCIATION ELBARAKAH TLEMCEN"
    },
    {
        geocode: [34.88705432445632, -1.3131239593708477],
        popUp: "جمعية البركة تلمسان ELBARAKAH TLEMCEN"
    },
    {
        geocode: [34.88665605101244, -1.3117887472623777],
        popUp: "Croissant rouge algérien"
    },
    {
        geocode: [35.380687254214436, 1.3310904439313074],
        popUp: "جمعية كافل اليتيم الولائية تيارت المكتب الولائي"
    },
    {
        geocode: [35.38039035480238, 1.325870978416379],
        popUp: "جمعية المسعفين المتطوعين تيارت"
    },
    {
        geocode: [35.36970124835183, 1.3270848076058974],
        popUp: "جمعية الطيبين الخيرية"
    },
    {
        geocode: [35.35961875146803, 1.3297714385742188],
        popUp: "جمعية الإخلاص والأصالة"
    },
    {
        geocode: [35.35215291522565, 1.308268903205158],
        popUp: "Orphans Association state office Tiaret state levels"
    },
    {
        geocode: [35.35250293694916, 1.3388246284778218],
        popUp: "جمعية كافل اليتيم الولائية المكتب البلدي تيارت"
    },
    {
        geocode: [35.34858260820605, 1.3353914010733796],
        popUp: "(مدرسة النبي اليتيم  (جمعية كافل اليتيم الولائية تيارت"
    },
    {
        geocode: [35.345486901459246, 1.328232585635004],
        popUp: "جمعية سواعد الاحسان تيارت"
    },
    {
        geocode: [36.700407642290415, 4.060947651857733],
        popUp: "Association Thafounasth Igoujilene"
    },
    {
        geocode: [36.70278088380241, 4.058191749399403],
        popUp: "Bureau association kafil el yatim"
    },
    {
        geocode: [36.703251014861316, 4.043805256761649],
        popUp: "Bureau El Baraka Tizi-ouzou"
    },
    {
        geocode: [36.70765498747024, 4.039427891820986],
        popUp: "Association nationale des commerçants et artisans Tizi Ouzou"
    },
    {
        geocode: [36.712609154992926, 4.051272526366311],
        popUp: "Association Assirem de Tizi ouzou"
    },
    {
        geocode: [36.71426047318507, 4.047667637591647],
        popUp: "Thafat Évènements"
    },
    {
        geocode: [36.71673738392552, 4.05522073788142],
        popUp: "Association (El Fedjr) d'aide aux personnes atteintes de cancer"
    },
    {
        geocode: [34.69428487527585, 3.269410972524661],
        popUp: "جمعية الإحياء التضامنية الخيرية"
    },
    {
        geocode: [34.67780701176577, 3.2517170891258576],
        popUp: "جمعية البركة للعمل الخيري والإنساني"
    },
    {
        geocode: [34.674802721085165, 3.2419913992042204],
        popUp: "الجمعية الخيرية كافل اليتيم بالجلفة"
    },
    {
        geocode: [34.67370862046888, 3.237217067167786],
        popUp: "الجمعية الخيرية الولائية للعلامة سيدي محمد بن المشري"
    },
    {
        geocode: [34.67194881491892, 3.2499237132435748],
        popUp: "جمعية تراحم الخيرية الحزائرية"
    },
    {
        geocode: [34.66970267714795, 3.2477649716429147],
        popUp: "جمعية الفجر لمساعدة مرضى السرطان"
    },
    {
        geocode: [34.666419440916194, 3.2517699985419664],
        popUp: "جمعية جزائر الخير الجلفة"
    },
    {
        geocode: [36.81876318823402, 5.768024490135091],
        popUp: "الجمعية الولائية الخيرية نور الناس"
    },
    {
        geocode: [36.81299129007597, 5.767209098626536],
        popUp: "جمعية البركة للعمل الخيري و الإنساني مكتب جيجل"
    },
    {
        geocode: [36.81336922524827, 5.772831008566936],
        popUp: "Kafil El Yatim Jijel"
    },
    {
        geocode: [36.80635652658584, 5.761666900629126],
        popUp: "جمعية الإرشاد والإصلاح"
    },
    {
        geocode: [36.80873709561762, 5.759031897496229],
        popUp: "Association Al Rissala"
    },
    {
        geocode: [36.80547285062124, 5.756929045711009],
        popUp: "جمعية بصمة خير جيجل"
    },
    {
        geocode: [36.15122094526114, 5.447062218447455],
        popUp: "جمعية سواعد الخير سطيف"
    },
    {
        geocode: [36.18970661274889, 5.400039222650665],
        popUp: "ness el khir setif"
    },
    {
        geocode: [36.191992524488455, 5.397464302097332],
        popUp: "جمعية بشرى ام الايتام لمرضى السرطان سطيف"
    },
    {
        geocode: [36.19379349886219, 5.393773582637557],
        popUp: "جمعية البركة سطيف"
    },
    {
        geocode: [36.19649488272165, 5.402528312862168],
        popUp: "جمعية الوئام الخيرية"
    },
    {
        geocode: [36.194555437054404, 5.414287116722382],
        popUp: "جمعية كافل اليتيم سطيف"
    },
    {
        geocode: [36.197395323394645, 5.426475074725001],
        popUp: "جمعية الإرشاد والإصلاح، بلدية سطيف"
    },
    {
        geocode: [36.2017588503076, 5.443126227636545],
        popUp: "جمعية مهي للاعمال الخيرية"
    },
    {
        geocode: [36.20418292684443, 5.414372948033471],
        popUp: "مقر جمعية شبابنا سطيف"
    },
    {
        geocode: [36.203698117545315, 5.412313011590804],
        popUp: "جمعية الأيادي الآمنة الخيرية لولاية سطيف"
    },
    {
        geocode: [36.203005527623375, 5.411197212684361],
        popUp: "جمعية غيث للعمل الخيري والإنساني"
    },
    {
        geocode: [34.561470768297, 0.26031739615400046],
        popUp: "جمعية كافل اليتيم الخيرية -فرع بلدية سيدي أحمد -"
    },
    {
        geocode: [34.676064447698074, 0.0099053131026091],
        popUp: "جمعية خيرية افعلوا الخير"
    },
    {
        geocode: [34.764443390447525, 0.1443019294969198],
        popUp: "جمعية كافل اليتيم عين الحجر سعيدة"
    },
    {
        geocode: [34.83773651424066, 0.15783694764820794],
        popUp: "جمعية البركة للعمل الخيرية و الإنساني"
    },
    {
        geocode: [34.84601001072167, 0.16232162352649973],
        popUp: "جمعية البركة المكتب الولائي الجديد"
    },
    {
        geocode: [36.85478618154519, 6.929658697689128],
        popUp: "Ness El Khir Skikda"
    },
    {
        geocode: [36.86436937225522, 6.921116529843723],
        popUp: "جمعية البركة للعمل الخيري و الإنساني"
    },
    {
        geocode: [36.86520366975717, 6.913659274165456],
        popUp: "جمعية المسعفين المتطوعين سكيكدة"
    },
    {
        geocode: [36.87457638174152, 6.904303729234513],
        popUp: "Association elbaraka bureau de wilaya de skikda"
    },
    {
        geocode: [36.87022920004382, 6.893143057406491],
        popUp: "لجنة الاغاثة لجمعية العلماء المسلمين الجزائريين شعبة سكيكده"
    },
    {
        geocode: [35.21995495866915, -0.6065532487564967],
        popUp: "بلعباس الخير Belabbes Elkheir"
    },
    {
        geocode: [35.21175063600132, -0.61668126952051],
        popUp: "جمعية البركة المكتب الولائي سيدي بلعباس"
    },
    {
        geocode: [35.22051590770863, -0.6210586344269902],
        popUp: "جمعية الصفا والمروة الخيرية"
    },
    {
        geocode: [35.20607023457472, -0.6214877878491942],
        popUp: "جمعية أسامة و ناس الخير"
    },
    {
        geocode: [35.21079108579658, -0.6259953984092134],
        popUp: "Guidance and Reform Society"
    },
    {
        geocode: [35.20998024071949, -0.6501406439612677],
        popUp: "Ihcen"
    },
    {
        geocode: [35.19408344572554, -0.615249474425942],
        popUp: "Good Keys Association"
    },
    {
        geocode: [35.19430433063049, -0.6230879914871463],
        popUp: "Association Kafil El yatim Sba جمعية كافل اليتيم سيدي بلعباس"
    },
    {
        geocode: [36.91062815248468, 7.735063671043424],
        popUp: "جمعية كافل اليتيم الوطنية - مكتب ولاية عنابة"
    },
    {
        geocode: [36.90471961106857, 7.743285603974983],
        popUp: "جمعية التكافل الخيرية"
    },
    {
        geocode: [36.907881985927204, 7.7474486079909655],
        popUp: "جمعية دار المصطفى لكفالة اليتيم عنابة Association orphelinat Annaba"
    },
    {
        geocode: [36.88494124494436, 7.727123350876718],
        popUp: "association el ghofraane"
    },
    {
        geocode: [36.375782407259486, 7.528700835952961],
        popUp: "جمعية النور الخيرية لولاية قالمة"
    },
    {
        geocode: [36.44479587097724, 7.437639054245163],
        popUp: "الجمعية الخيرية الولائية أيادي الخير لولاية قالمة"
    },
    {
        geocode: [36.452683702404045, 7.431158240673692],
        popUp: "جمعية كافل اليتيم قالمه"
    },
    {
        geocode: [36.45848265447925, 7.426695045082771],
        popUp: "جمعية فرسان الخير قالمه"
    },
    {
        geocode: [36.45954218468248, 7.430687055399315],
        popUp: "جمعية البركة للعمل الخيري والانساني مكتب قالمة"
    },
    {
        geocode: [36.46537088725001, 7.431380956195919],
        popUp: "جمعية يد العون للتكفل بمرضى السرطان"
    },
    {
        geocode: [36.4664869717985, 7.430532855222293],
        popUp: "Association Moutamaizoun Guelma جمعية متميزون قالمة"
    },
    {
        geocode: [36.46933726555944, 7.41608267475972],
        popUp: "الجمعية الولائية أيادي الخير لولاية قالمة"
    },
    {
        geocode: [36.463401068979984, 7.410246188217747],
        popUp: "جمعية الارشاد والاصلاح"
    },
    {
        geocode: [36.462434668377846, 7.406126315364588],
        popUp: "مقر جمعية الإزدهار حي بوالنار صالح"
    },
    {
        geocode: [36.263674399701635, 6.717761969874723],
        popUp: "جمعية كافل اليتيم مكتب الخروب"
    },
    {
        geocode: [36.2785655390483, 6.502896790188216],
        popUp: "جمعية البركة للعمل الخيري و الإنساني - elbaraka aïn smara"
    },
    {
        geocode: [35.19408344572554, -0.615249474425942],
        popUp: "جمعية اليد المبسوطة الخيرية"
    },
    {
        geocode: [36.26260011782162, 6.562810806760144],
        popUp: "جمعية الإرشاد و الإصلاح الجزائرية"
    },
    {
        geocode: [36.26026212521793, 6.582655663652845],
        popUp: "جمعية خيرية بونك البراك"
    },
    {
        geocode: [36.26658517417142, 6.577913991654396],
        popUp: "جمعية البركة للعمل الخيري والإنساني"
    },
    {
        geocode: [36.2586171615942, 6.582663624181552],
        popUp: "جمعية اليد المبسوطة الخيرية"
    },
    {
        geocode: [36.26418037743701, 6.598190802080216],
        popUp: "Association nationale d’aide aux malades Winelka bureau de Constantine"
    },
    {
        geocode: [36.30344995035557, 6.619724592183181],
        popUp: "Dz Elkheir Constantine"
    },
    {
        geocode: [36.31198419900404, 6.625019786025896],
        popUp: "Djoussour el Kheir"
    },
    {
        geocode: [36.35644587242131, 6.602963694040501],
        popUp: "ASSOCIATION DOUNIA"
    },
    {
        geocode: [36.362959166154745, 6.594093068141035],
        popUp: "جمعية اليد المبسوطة الخيرية"
    },
    {
        geocode: [36.35539529012652, 6.631140976309397],
        popUp: "جمعية الإرشاد و الإصلاح مكتب التوت - قسنطينة"
    },
    {
        geocode: [36.36232887163767, 6.605050900760144],
        popUp: "جمعية الشفاء الخيرية"
    },
    {
        geocode: [36.38207568646636, 6.6303582746498],
        popUp: "Association Ness El Kheir"
    },
    {
        geocode: [36.3659004753829, 6.642620610452005],
        popUp: "جمعية الولد الصالح الخيرية"
    },
    {
        geocode: [36.362328871409055, 6.642359710732999],
        popUp: "جمعية الإرشاد والإصلاح الجزائرية"
    },
    {
        geocode: [36.25531343653072, 2.7560281271568376],
        popUp: "جمعية أصدقاء المريض لولاية المدية"
    },
    {
        geocode: [36.266455932765, 2.758173894267858],
        popUp: "Association Amis De Malade Medea"
    },
    {
        geocode: [36.26541787914463, 2.7683019150318704],
        popUp: "مؤسسة سقيا الخيرية الجزائرية"
    },
    {
        geocode: [36.26922400829577, 2.763409566018746],
        popUp: "_جمعية البركة للعمل الخيري والإنساني_مكتب المدية"
    },
    {
        geocode: [36.270054412067665, 2.7701901905375403],
        popUp: "جمعية العلماء المسلمين الجزائريين مكتب شعبة المدية"
    },
    {
        geocode: [35.90950399955758, 0.12157967632768499],
        popUp: "جمعية كافل اليتيم فرع صيادة ولاية مستغانم"
    },
    {
        geocode: [36.35581552474597, 6.602180991755255],
        popUp: "جمعية العلماء المسلمين الجزائريين"
    },
    {
        geocode: [35.93522150828998, 0.11076501008814554],
        popUp: "الجمعية الخيرية كافل اليتيم مستغانم"
    },
    {
        geocode: [35.9210910198136, 0.0754022581679571],
        popUp: "جمعية مستغانم bénévole"
    },
    {
        geocode: [35.93985592603101, 0.10509967600955655],
        popUp: "مقر الجمعية الخيرية بسمة اليتيم مستغانم"
    },
    {
        geocode: [35.940272873355134, 0.10115146452528026],
        popUp: "جمعية البركة الجزائرية للعمل الخيري والانساني المكتب الولائي مستغانم"
    },
    {
        geocode: [35.94110676140454, 0.09411334840113554],
        popUp: "الجمعية الخيرية كافل اليتيم بتجديت"
    },
    {
        geocode: [35.733581271413655, 4.540634598710854],
        popUp: "جمعية سواعد الأمل لرعاية ودعم المريض بالمسيلة"
    },
    {
        geocode: [35.72898276557367, 4.538917985022038],
        popUp: "جمعية العلماء المسلمين الجزائريين بالمسيلة"
    },
    {
        geocode: [35.720063694459775, 4.546986069359472],
        popUp: "جمعية البر الخيرية لرعاية مرضى السرطان"
    },
    {
        geocode: [35.71699753314376, 4.5382313395465115],
        popUp: "El Bir charity association"
    },
    {
        geocode: [35.71774577645198, 4.528101738305831],
        popUp: "جمعية وافعلوا الخير المسيلة"
    },
    {
        geocode: [35.71175254039642, 4.542864616029647],
        popUp: "جمعية كافل اليتيم مكتب بلدية مسيلة"
    },
    {
        geocode: [35.714400770045636, 4.538229759069844],
        popUp: "Ghaith Msila"
    },
    {
        geocode: [35.707292165241874, 4.546297843407278],
        popUp: "جمعية الهلال الأحمر الجزائري لولاية المسيلة"
    },
    {
        geocode: [35.70520127846802, 4.5293033678880015],
        popUp: "جمعية البركة للعمل الخيري و الانساني المسيلة"
    },
    {
        geocode: [35.70659401908772, 4.544241228958197],
        popUp: "الجمعية الخيرية كافل اليتيم - المكتب الولائي المسيلة"
    },
    {
        geocode: [35.74036443870717, 4.488351591788964],
        popUp: "المشروع الخيري مركز إيواء وإستقبال مرضى السرطان بولاية المسيلة"
    },
    {
        geocode: [35.40754123105896, 0.13593193798828987],
        popUp: "جمعية البركة للعمل الخيري والإنساني معسكر"
    },
    {
        geocode: [31.95516534188552, 5.3361614072622965],
        popUp: "جمعية غوث للبحث والانقاد فرع ورقلة"
    },
    {
        geocode: [31.94875301758249, 5.325842762556058],
        popUp: "جمعية البركة - مكتب ورقلة"
    },
    {
        geocode: [31.946039976408617, 5.317849446234323],
        popUp: "جمعية وافعلوا الخير"
    },
    {
        geocode: [31.955781887902962, 5.317413446485703],
        popUp: "جمعية أحباب المريض ورقلة"
    },
    {
        geocode: [31.95713827465795, 5.305932137587211],
        popUp: "جمعية البيت السعيد مخادمة"
    },
    {
        geocode: [31.96157721852894, 5.3068041357314],
        popUp: "جمعية زمزم الخيرية ورقلة"
    },
    {
        geocode: [31.988206375344156, 5.295758825905003],
        popUp: "مزرعة بودواية لإنتاج وتوضيب التمور"
    },
    {
        geocode: [33.67331077312282, 1.0303075814895997],
        popUp: "الجمعية الخيرية كافل اليتيم بالبيض"
    },
    {
        geocode: [33.683187332620165, 1.025059932253506],
        popUp: "المقر الرئيسي للجمعية الخيرية كافل اليتيم الوطني- ولاية البيض -ة"
    },
    {
        geocode: [33.685639211239874, 1.0153660905423],
        popUp: "جمعية البركة للعمل الخيري و الإنساني البيض"
    },
    {
        geocode: [33.679496946823555, 1.0148511064356553],
        popUp: "الجمعية الخيرية سبل الخير البيض"
    },
    {
        geocode: [36.08336654291017, 4.7903902128102684],
        popUp: "جمعية كافل اليتيم المحلية"
    },
    {
        geocode: [36.071927777299074, 4.782088910654563],
        popUp: "الجمعية الخيرية كافل اليتيم الوطنية برج بوعريريج"
    },
    {
        geocode: [36.0602673233067, 4.775148477704711],
        popUp: "مؤسسة المعارف الخيرية لتحفيظ القرآن الكريم"
    },
    {
        geocode: [36.07142370665892, 4.74782558592751],
        popUp: "مكتب جمعية البركة"
    },
    {
        geocode: [36.07794473710826, 4.753490411100602],
        popUp: "الجمعية الاجتماعية للتضامن ومساعدة المريض المكتب البلديّ برج بوعريريج"
    },
    {
        geocode: [36.07461491677682, 4.761215172700273],
        popUp: "جمعية أصدقاء البيئة و الطبيعة لمدينة برج بوعريريج"
    },
    {
        geocode: [36.08488957122165, 4.7597812907198636],
        popUp: "جمعية الأمل برج بوعريريج"
    },
    {
        geocode: [36.071770458864805, 4.770119190701925],
        popUp: "جمعية القلوب الطيبة لولاية برج بوعريريج"
    },
    {
        geocode: [36.0739178870186, 4.771085308290726],
        popUp: "المنظمة الجزائرية للعمل الخيري و الإنساني"
    },
    {
        geocode: [36.761297459484524, 3.7327459739833913],
        popUp: "الجمعية الخيرية لمسة الخير لولاية بومرداس"
    },
    {
        geocode: [36.737601763996366, 3.625297197741491],
        popUp: "كافل اليتيم سي مصطفى"
    },
    {
        geocode: [36.779016251613484, 3.47651163068795],
        popUp: "Association écologique de Boumerdès"
    },
    {
        geocode: [36.77626802585303, 3.4567825582475535],
        popUp: "جمعية كافل اليتيم بومرداس / المكتب الولائي"
    },
    {
        geocode: [36.759776602204404, 3.4447735576316596],
        popUp: "(اللجنة الاجتماعية)جمعية كافل اليتيم بومرداس"
    },
    {
        geocode: [36.754278672831994, 3.4010264839594755],
        popUp: "الجمعية الوطنية اسعى للخير مكتب بلدية بودواو"
    },
    {
        geocode: [36.76252541887792, 3.341839258248974],
        popUp: "جمعية البركة الجزائرية مكتب الرغاية"
    },
    {
        geocode: [36.67313845599643, 3.242336110288712],
        popUp: "جمعية خيرية"
    },
    {
        geocode: [36.722443435260864, 3.1642546240309777],
        popUp: "جمعية الانصاف الخيرية"
    },
    {
        geocode: [36.930538463901826, 8.443197375204054],
        popUp: "مقر جمعية الخيرية اصدقاء القالة"
    },
    {
        geocode: [36.82021799758071, 8.386645711752234],
        popUp: "ASSOCIATION CARITATIVE AL IHSSAN"
    },
    {
        geocode: [36.79405525000349, 8.284985151524307],
        popUp: "جمعية الرفيق الخيرية"
    },
    {
        geocode: [36.9015560250952, 7.896496582081862],
        popUp: "جمعية البركة للعمل الخيري و الانساني بن مهيدي"
    },
    {
        geocode: [36.73879343284806, 7.849297036261752],
        popUp: "الجمعية الخيرية صنائع المعروف الطارف"
    },
    {
        geocode: [36.73297408118242, 7.740374985082084],
        popUp: "ASSOCIATION EL OUEJDAN"
    },
    {
        geocode: [27.673399893106996, -8.140091993465512],
        popUp: "الجمعية الولائية ناس الخير تندوف"
    },
    {
        geocode: [36.82021799758071, 8.386645711752234],
        popUp: "ASSOCIATION CARITATIVE AL IHSSAN"
    },
    {
        geocode: [36.82021799758071, 8.386645711752234],
        popUp: "ASSOCIATION CARITATIVE AL IHSSAN"
    },
];

    return (
        <div className="w-full h-[500px] rounded-2xl overflow-hidden shadow-lg border border-gray-300">
            <MapContainer center={[36.743002, 3.084316]} zoom={11} className="w-full h-full">
        {/*<TileLayer
            attribution='&copy; <a href="https://www.openstreetmap.org/copyright">OpenStreetMap</a> contributors'
            url='https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png'

        />*/}

        <TileLayer
        attribution='AlidadeSatellite'
        url='https://tiles.stadiamaps.com/tiles/alidade_satellite/{z}/{x}/{y}{r}.jpg'
    />
        <MarkerClusterGroup
        chunkedLoading
        iconCreateFunction={createClusterCustomIcon}>

        {markers.map((marker, index) => (
            <Marker key={index} position={marker.geocode} icon={customIcon}>
                <Popup>{marker.popUp}</Popup>
            </Marker>
        ))}
        </MarkerClusterGroup>
        </MapContainer>
        </div>
)
}
